#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Лабораторная работа №10
Игровые модели. Решения игровых задач
"""

from typing import List, Tuple, Dict

class GameTheorySolver:
    """Класс для решения игровых задач"""
    
    def __init__(self):
        self.results = []
    
    def solve_stone_game(self, pile1: int, pile2: int, win_threshold: int):
        """
        Решение игровой задачи с камнями
        
        Args:
            pile1: количество камней в первой куче
            pile2: количество камней во второй куче
            win_threshold: порог для победы (сумма камней >= win_threshold)
        
        Returns:
            Кто выигрывает и выигрышная стратегия
        """
        print("\n" + "="*80)
        print(f"ИГРА С КАМНЯМИ: ({pile1}, {pile2}) камней, порог победы: {win_threshold}")
        print("="*80)
        print("\nПравила игры:")
        print("  - Два игрока ходят по очереди")
        print("  - Каждый ход: умножить на 2 или добавить 4 камня в одну из куч")
        print("  - Проигрывает тот, после чьего хода сумма >= порога")
        print()
        
        # Таблица игры
        memo = {}
        
        def can_win(p1, p2, player_turn):
            """
            Определяет, может ли игрок выиграть при оптимальной игре
            
            player_turn: 1 - первый игрок, 2 - второй игрок
            Возвращает True если текущий игрок может выиграть
            """
            state = (p1, p2, player_turn)
            if state in memo:
                return memo[state]
            
            total = p1 + p2
            
            # Если сумма уже >= порога, предыдущий игрок проиграл
            if total >= win_threshold:
                return False
            
            # Генерируем все возможные ходы
            moves = [
                (p1 * 2, p2),    # Умножить первую кучу на 2
                (p1 + 4, p2),    # Добавить 4 в первую кучу
                (p1, p2 * 2),    # Умножить вторую кучу на 2
                (p1, p2 + 4),    # Добавить 4 во вторую кучу
            ]
            
            # Проверяем каждый ход
            for new_p1, new_p2 in moves:
                new_total = new_p1 + new_p2
                
                # Если после хода сумма >= порога, это победный ход
                if new_total >= win_threshold:
                    memo[state] = True
                    return True
                
                # Если после этого хода противник не может выиграть, это победный ход
                if not can_win(new_p1, new_p2, 3 - player_turn):
                    memo[state] = True
                    return True
            
            # Если нет победных ходов
            memo[state] = False
            return False
        
        # Анализ игры
        print("Анализ возможных ходов:")
        print("-" * 80)
        
        # Проверяем первые ходы первого игрока
        first_moves = [
            (pile1 * 2, pile2, f"({pile1}*2, {pile2})"),
            (pile1 + 4, pile2, f"({pile1}+4, {pile2})"),
            (pile1, pile2 * 2, f"({pile1}, {pile2}*2)"),
            (pile1, pile2 + 4, f"({pile1}, {pile2}+4)"),
        ]
        
        winning_moves_p1 = []
        
        for new_p1, new_p2, move_desc in first_moves:
            total = new_p1 + new_p2
            
            print(f"\nХод 1-го игрока: {move_desc} -> сумма = {total}")
            
            if total >= win_threshold:
                print(f"  ❌ Первый игрок проигрывает сразу!")
                continue
            
            # Проверяем, может ли второй игрок выиграть после этого хода
            if not can_win(new_p1, new_p2, 2):
                print(f"  ✓ ВЫИГРЫШНЫЙ ХОД для первого игрока!")
                winning_moves_p1.append((new_p1, new_p2, move_desc))
            else:
                print(f"  ❌ После этого хода второй игрок может выиграть")
        
        # Определяем победителя
        print("\n" + "="*80)
        if winning_moves_p1:
            winner = "ПЕРВЫЙ ИГРОК"
            print(f"✓ ПОБЕДИТЕЛЬ: {winner}")
            print(f"\nВыигрышные ходы первого игрока:")
            for _, _, move in winning_moves_p1:
                print(f"  - {move}")
            result = (winner, winning_moves_p1[0][2])
        else:
            winner = "ВТОРОЙ ИГРОК"
            print(f"✓ ПОБЕДИТЕЛЬ: {winner}")
            print("  У первого игрока нет выигрышной стратегии")
            result = (winner, "Любой ход первого игрока")
        
        print("="*80)
        
        self.results.append((f"Игра ({pile1}, {pile2})", result))
        return result
    
    def solve_nim_game(self, piles: List[int]):
        """
        Решение игры НИМ
        
        Args:
            piles: список куч с камнями
        """
        print("\n" + "="*80)
        print(f"ИГРА НИМ: Кучи {piles}")
        print("="*80)
        print("\nПравила игры НИМ:")
        print("  - Два игрока ходят по очереди")
        print("  - Каждый ход: взять любое количество камней из одной кучи")
        print("  - Проигрывает тот, кто не может сделать ход (все кучи пусты)")
        print()
        
        # Вычисляем XOR сумму (стратегия Nim)
        xor_sum = 0
        for pile in piles:
            xor_sum ^= pile
        
        print("Анализ по стратегии XOR:")
        for i, pile in enumerate(piles, 1):
            print(f"  Куча {i}: {pile} камней (двоичное: {bin(pile)})")
        
        print(f"\nXOR-сумма: {xor_sum} (двоичное: {bin(xor_sum)})")
        
        if xor_sum == 0:
            winner = "ВТОРОЙ ИГРОК"
            strategy = "Позиция симметричная, второй игрок всегда может ответить симметрично"
        else:
            winner = "ПЕРВЫЙ ИГРОК"
            strategy = "Позиция несимметричная, первый игрок может привести к XOR=0"
        
        print(f"\n✓ ПОБЕДИТЕЛЬ: {winner}")
        print(f"  Стратегия: {strategy}")
        print("="*80)
        
        self.results.append((f"НИМ {piles}", (winner, strategy)))
        return winner, strategy
    
    def solve_chomp_game(self, rows: int, cols: int):
        """
        Решение игры "Шоколадка" (Chomp)
        
        Args:
            rows: количество строк
            cols: количество столбцов
        """
        print("\n" + "="*80)
        print(f"ИГРА 'ШОКОЛАДКА' (CHOMP): {rows}x{cols}")
        print("="*80)
        print("\nПравила игры:")
        print("  - Шоколадка размером {rows}x{cols}")
        print("  - Левая верхняя клетка отравлена")
        print("  - Каждый ход: выбрать клетку и съесть её вместе со всеми правее и ниже")
        print("  - Проигрывает тот, кто вынужден съесть отравленную клетку")
        print()
        
        # Для игры Chomp: первый игрок всегда может выиграть (кроме 1x1)
        if rows == 1 and cols == 1:
            winner = "ВТОРОЙ ИГРОК"
            strategy = "Единственная клетка отравлена, первый игрок сразу проигрывает"
        else:
            winner = "ПЕРВЫЙ ИГРОК"
            strategy = "Первый ход: съесть клетку (2,2). Далее зеркальная стратегия"
        
        print(f"✓ ПОБЕДИТЕЛЬ: {winner}")
        print(f"  Выигрышная стратегия: {strategy}")
        print("="*80)
        
        self.results.append((f"Шоколадка {rows}x{cols}", (winner, strategy)))
        return winner, strategy
    
    def create_summary_report(self):
        """Создание итогового отчета"""
        print("\n" + "="*80)
        print("ИТОГОВЫЙ ОТЧЕТ ПО ЛАБОРАТОРНОЙ РАБОТЕ №10")
        print("="*80)
        
        report = """
ЛАБОРАТОРНАЯ РАБОТА №10
Игровые модели. Решения игровых задач

ВЫПОЛНЕННЫЕ ЗАДАЧИ:
"""
        
        for i, (game_name, (winner, strategy)) in enumerate(self.results, 1):
            report += f"\n{i}. {game_name}\n"
            report += f"   Победитель: {winner}\n"
            report += f"   Стратегия: {strategy}\n"
        
        report += """
ИСПОЛЬЗОВАННЫЕ МЕТОДЫ:
- Динамическое программирование с мемоизацией
- Теория игр (стратегия XOR для игры НИМ)
- Анализ дерева игры
- Поиск выигрышных позиций

ТЕОРЕТИЧЕСКИЕ ОСНОВЫ:
1. Комбинаторная теория игр
2. Позиции P и N (выигрышные и проигрышные)
3. Стратегия отражения
4. Теорема Спрага-Гранди

ВЫВОДЫ:
Все игровые задачи решены с определением победителя и выигрышной стратегии.
Для каждой игры найдена оптимальная стратегия при безошибочной игре обоих игроков.
"""
        
        print(report)
        
        with open('labs/Lab10_Game_Theory_Report.txt', 'w', encoding='utf-8') as f:
            f.write(report)
        
        print("✓ Отчет сохранен: labs/Lab10_Game_Theory_Report.txt")
        print("="*80)

def main():
    """Главная функция"""
    print("\n" + "="*80)
    print(" "*20 + "ЛАБОРАТОРНАЯ РАБОТА №10")
    print(" "*15 + "Игровые модели. Решения игровых задач")
    print("="*80)
    
    solver = GameTheorySolver()
    
    # Задача 1: Игра с камнями (из примера в документе)
    print("\n📋 ЗАДАЧА 1: Игра с камнями")
    solver.solve_stone_game(3, 4, 25)
    
    # Задача 2: Другой вариант игры с камнями
    print("\n📋 ЗАДАЧА 2: Игра с камнями (другой вариант)")
    solver.solve_stone_game(5, 7, 30)
    
    # Задача 3: Игра НИМ
    print("\n📋 ЗАДАЧА 3: Игра НИМ")
    solver.solve_nim_game([3, 5, 7])
    
    # Задача 4: Игра "Шоколадка"
    print("\n📋 ЗАДАЧА 4: Игра 'Шоколадка'")
    solver.solve_chomp_game(4, 5)
    
    # Создание итогового отчета
    solver.create_summary_report()
    
    print("\n✓ Лабораторная работа №10 успешно выполнена!")
    print("  Решено игровых задач: 4")
    print("  Файлы сохранены в директории: labs/")

if __name__ == "__main__":
    main()
